// © Copyright 2015-2016 HP Development Company, L.P.

WDTTaskName = "Wi-Fi Direct";

WDTTaskTitle = "Enable Wi-Fi Direct";
WDTTaskDescription = "Make it easy to connect to your printer from wireless-enabled smartphones, notebook computers or other mobile devices using a direct wireless connection.";

WDTSecurityRequiredDescription = "Limit access to the printer by providing a passphrase (required).";

WDTPassphraseTitle = "Passphrase:";
WDTShowPassphraseButtonTitle = "Show passphrase";
WDTSavePassphraseButtonTitle = "Save passphrase in my keychain";
WDTEmptyPassphraseError = "Passphrase cannot be empty.";
WDTTooShortPassphraseError = "Passphrase must be at least 8 characters.";

WDTConfigureWiFiDirectButtonTitle = "Configure my Mac to seamlessly use HP Wi-Fi Direct";
WDTConfigureWiFiDirectDescription = "Set up my Mac to automatically join the printer's Wi-Fi Direct network when away from my regular wireless network.";
WDTConfigurtWiFiDirectAdditionalDescription = "Enable quick switching between my regular network configuration and configuration for the printer’s Wi-Fi Direct network by using the Location submenu of the Apple menu.";
WDTConfigureWiFiDirectExtendedDescription = "WDT_TEXT:WDTConfigureWiFiDirectDescription\nWDTConfigurtWiFiDirectAdditionalDescription";

WDTMoreInfoLinkTitle = "To learn more about using your printer’s Wi-Fi Direct, visit";

WDTCannotBeEnabledErrorTitle = "Cannot enable Wi-Fi Direct";
WDTCannotBeEnabledErrorDescription = "Wi-Fi Direct cannot be enabled in your printer’s current configuration. For more information, try to turn on Wi-Fi Direct using the printer's control panel or home page, which is also called the embedded web server or EWS.";
